{
  "timestamp": "2025-12-16T21:32:46.487055",
  "key": "details:ChIJDy4b5q1ZwokR7Ayp1Ap3-c0",
  "data": {
    "name": "Chipotle Mexican Grill",
    "place_id": "ChIJDy4b5q1ZwokR7Ayp1Ap3-c0",
    "address": "304 W 34th St., New York, NY 10001, USA",
    "rating": 3.9,
    "total_ratings": 1849,
    "phone": "(212) 268-4197",
    "website": "https://locations.chipotle.com/ny/new-york/304-w-34th-st?utm_source=google&utm_medium=yext&utm_campaign=yext_listings",
    "price_level": 1,
    "types": [
      "establishment",
      "food",
      "point_of_interest",
      "restaurant"
    ],
    "reviews": [
      {
        "author": "Trương Trà My",
        "rating": 5,
        "text": "I recently dined at Chipotle and had a great experience. The atmosphere was casual, bright, and clean- perfect for a quick meal but also comfortable enough to sit and enjoy without feeling rushed. The Open-kitchen setup gives you a clear view of how you food prepared, which makes the experience more engaging and transparent.\nThe service was efficient and friendly. The staff patiently walked me through the different options for my burrito bowl, making sure I got exactly what I wanted. They moved quickly, even though the line was fairly long, and kept the area tidy.\n\nThe menu highlights are definitely the customizable bowls and burritos. I chode a chicken burrito bowl with brown rice, black beans, fajita veggies, corn salsa, and guacamole. The ingredients tasted fresh, the chicken was well-seasoned, and the guacamole added the perfect creamy balance. Portion sizes are generous, making it excellent value for price.",
        "time": 1757992222
      },
      {
        "author": "darshini gosalia",
        "rating": 3,
        "text": "Disappointed at a Landmark: A Frustrating Experience at Chipotle, Empire State Building\n\nVisiting the iconic Empire State Building should be an exciting moment, especially when grabbing a quick bite from a trusted brand like Chipotle. Unfortunately, my recent visit left me with frustration and disappointment — not what anyone expects at one of the most famous landmarks in the world.\n\nI stopped by the Chipotle inside the Empire State Building to pick up my usual veggie bowl. Normally, I pay around $15, including chips and a dip. But to my surprise, this time the total came to $21.00 — for a simple veggie bowl. That’s almost $6 more than what I typically pay.\n\nEven more surprising, the beans were out of stock, so I asked for queso instead — which is usually just a $1.00 add-on. When I asked the cashier why the total was so high, he rudely responded, “I’m not bothered,” and said he charged me extra for the queso. Instead of $1.00, he added $3.00.\n\nTrying to keep calm, I then ordered chips and salsa. My final total was $18.00, but I still wasn’t sure where the charges added up. When I asked for a spoon at the end, the cashier showed me attitude again — clearly uninterested in helping or making things right.\n\nThis isn’t just about a few extra dollars. It’s about how customers are treated, especially at a tourist-heavy location like the Empire State Building. People from all over the world visit this site, and this kind of behavior can leave a lasting negative impression.\n\nChipotle is known for its consistency and customer service. But this experience left me questioning that reputation. I hope the management at this location takes this seriously and ensures better training and customer care — because small interactions can shape big opinions, especially in a place as iconic as New York City.",
        "time": 1751031193
      },
      {
        "author": "Alia Mansoor",
        "rating": 5,
        "text": "Loved the food\nAs its my first time trying chipotle But I loved the taste and the portion size is also big enough",
        "time": 1759543295
      },
      {
        "author": "Ruth A",
        "rating": 4,
        "text": "Chipotle is always a solid choice when you want something quick but fresh. I like that you can customize your bowl or burrito with plenty of options, and the portions are generous. The food usually tastes fresh, and I appreciate that they offer healthier choices compared to typical fast food.\n\nThat said, the lines can get long during busy hours, and sometimes the consistency in portion size depends on who’s serving. Overall, it’s a reliable spot for a tasty meal at a reasonable price.",
        "time": 1757281586
      },
      {
        "author": "JD",
        "rating": 1,
        "text": "The workers don't care, the portioning of ingredients is inconsistent, and the quality of food is just poor. Utterly favorless without pouring jalapeno tabasco sauce on every bite. Chips were soft, certainly not fresh.\n\nWe purchased a fountain drink at 11:30AM to discover the ice machine was not working. We weren't informed of this nor was there any sign on the machine. I would not have purchased a drink had I known the drinks would be warm. Poor management.\n\nAlso, it smells weird in there.",
        "time": 1763313300
      }
    ],
    "photos": [
      "AZLasHplsBsP83luKJyBgyjGd2QbFWRaKpqWMwXjs5pbB9LkY0ZZJggjScqwgniBWd5hJY5mYrHYVGWEnv6Zxh7IV_bTZieAw_-Kxrh9VkPTQo7QyNmcS1XNhGVdU_iMBCGAMKqBVzC9tcD5FL7PyxM956RFiE2LBbSdFEg7MgCxbz2zmdhWr73hoq2nk7umU3eGaZj5nIfuhcpo1rYhTnbj3sx30DCgiECts2UksEQki45MKcNRiGwhQWcS_znVrEr8u1xFa0uQvOqRN2woswtK63GGCtRLGsJwpyrFoLNeURd0fiM__BM9BF5RxNvyJyTyh0VTyIoirnNroRH4CqoOzF6eL8fxKO90gJ-YJ9ZSQqP-r8EsvR-2-jGUPPTsat_YcSlR8G8jhyRgAgBa_unSovAt_hqclPMbOkTbwNj-A2kWnA",
      "AZLasHrmrF4Ay64exTD4d38UKWOqGx5YcwjPbzeARjc3azIpmBVb6YfmuAopBjmsTYrK7eURoAgVoLw6bz-SZejahpvhx0TVSnxTreRumS2CwaY2eArRFBw9cgNDf_226ub5q-0hLN-aouiujKuZ2PXGcuf1dzD_qDZY_mNUlgaAe_JA9Z02KW4Ld7T3gFOpxRTIBoATs_TX5pYJs6LAlst4OAT7wtsIrfWH7lJq14j1La5deJPEkiK9RbtMat9VSg5Y8k-Iv1bepEK_k6lvXjjVmBNK2f3kZzMu38OCzsZlgXRpOQ",
      "AZLasHpZlgsI8AP34Km_Kru19TH2rdLOySnSQ1WZrK4bEpusX4SCwivdSxeXQ33IGvCJTwAKaYwiIJETAFxOIC-COfxGcLIQmS_uMAZrdHGVmX50dR4E5zfEFcm90AjyEMP6T4Tknp3gzlr_2sr8Ah9QhXzBq-oOiVnf0mn0zbadjf1GVsLBgHXDWq5I6WtA1-vS_zQHW0baWP9ecXY75_RRI7C-_ftur4bYt50Ogiws53qqRPGWoHjcOmB2EoJhvAJ3K5hDnBZjNKm6R_dDnyEaIEX3j-kJ9V8YmDOCH5JWg3EnrtLVyMBDySe8rYeEZLaU5tVL2av4ydkjjn1bySqfG3qVEd2SDygEokQxj65rzyWkd0zEWY-Ze0E6hTKqCTZloiLcL-WKwoupJNtwOpf4IpSZuscPSiONQ9wVtYN5F-v7oet1JTjHKjXxU0KT0M0i",
      "AZLasHoi6Tdd8nu5-W1YYrlJHGiG_qJ_jsA1J7hPfte1MpLPOf8tEeN95pU1MiohICkDgmPcHCfwggZkGZVaQzw7U7kMaTKiQ3VuhLfGMbmE4EMZGQP58928cRiTzXgl88hCHIshb59gnLXqIdy8XKZtZbv4voVwyomjEiOzBUgR9R_iFPZJV_KHja73xSKXuHG36Khl-0oNkGEX0EMl7dg5zEyJ19HzZzjpbdXGkOGFk1LlXrieTDPjO51KOaePz3r7AaOuItsazCtt51NvFBqedoKG0wKHSbX4AW_xBmF0HuacbQ",
      "AZLasHoyMbNcNUAGcoTk9vNPDgc5jGUEkBjjDcQS1t478BvEzKVvbUpNVQO6w07ysshN9uwJHUqRkjhNzYe-avVQXVr5N0wEb0sstgtcTirDTylzasG0WlM15repHfqpmBjpDcRHQNFDqE5DpG6RtFeM-tieRh1-sn926dgrUrXQPIGFNqgXqVyJnpZeDOGeiILF9Ey21FWsA3Wkk8-RLd-NW4xuRcQ2nq6pqs8EK6FOOOrExTH5GyFer1ip-Ym-Ji7N0TiVjTlMF6p8Wy6_d52wINuNh2z6hItEymB49Z_Q-K2lS1x3Bv_TvJMDoI3PKIeju4UP8q3WSPuKD_mZUR3kp9tf804W6jlCrV8srZyG0KFqhrVrvEK4ElJwS9ByOFGzY4B3h661r27msXf4w1PxAIfW4-Pl6HnVhEtLFppSjPBq_g"
    ]
  }
}