{
  "timestamp": "2025-12-16T21:57:51.952513",
  "key": "menu_text:https://greatwallchinesestamford.com/",
  "data": "Best Chinese in Stamford, CT  Great Wall Chinese Restaurant  Order Online Great Wall Chinese Restaurant 219 Atlantic St, Stamford, CT 06901 203 327-7188 Menu Terms and Conditions Privacy Policy Cookies Policy Accessibility Menu Menu availability may vary based on the time of your order. All Day Menu Lunch Menu 1100 AM - 300 PM Menus All Day Menu Lunch Menu Special Fried Dishes Appetizers Soup Fried Rice Lo Mein Chow Mei Fun  Chow Fun Egg Foo Young Pork Vegetables Chicken Beef Seafood Healthy Choice Steamed Dishes Side Order Chefs Suggestions Dinner Specials Beverage Party Tray Special Fried Dishes Often Liked Fried Chicken Wings 4  7.78 Fried 12 Chicken  8.13 Fried Shrimp 8  9.37 Fried B-B-Q Rib Tips  7.72 Fried Crab Sticks 5  7.72 Fried Scallops  8.30 Chicken Nuggets 10  7.21 Bar-B-Q Chicken Wings  8.91 Buffalo Chicken Wings  8.91 Chicken Wings with Garlic Sauce  8.91 Indian Curry Chicken Wing  8.91 French Fries  4.26 Fried Plantain  5.50 Appetizers Popular 1. Pork Egg Roll  2.22 Popular 2. Shrimp Roll  2.27 Popular 3. Spring Roll  2.27 4. Fried Wontons Pork 10  6.64 5. Cheese Wonton 8  6.64 6. Meat Dumplings 8  8.86 7. Fried Chicken Dumpling  8.86 7. Steamed Chicken Dumpling  8.86 8. Steamed Shrimp Dumpling  9.43 9. Boneless Spare Ribs  10.05 10. BBQ Spare Ribs  10.05 12. Chicken on the Stick  7.72 13. Kids Happy Box Crab Rangoon 2, Chicken on the Stick 2, Egg Roll 2, Fried Shrimp 2  11.13 Soup with dry noodles 15. Wonton Soup  3.63 16. Egg Drop Soup  3.40 17. Wonton Egg Drop Soup  3.74 18. Chicken Noodle Soup  3.63 18. Chicken Rice Soup  3.63 19. Hot  Sour Soup  3.74 20. Bean Curd with Veg. Soup  3.53 21. House Special Wonton Soup  9.43 22. Seafood Soup  9.87 Fried Rice 23. Plain Fried Rice  5.22 24. Vegetable Fried Rice  6.81 25. Roast Pork Fried Rice  6.81 26. Chicken Fried Rice  6.81 27. Beef Fried Rice  7.90 28. Shrimp Fried Rice  7.90 29. House Special Fried Rice  8.13 30. Yang Chou Fried Rice  12.38 Lo Mein Soft Noodles 31. Plain Lo Mein  6.08 32. Vegetable Lo Mein  7.67 33. Roast Pork Lo Mein  7.67 34. Chicken Lo Mein  7.67 35. Beef Lo Mein  8.35 36. Shrimp Lo Mein  8.35 37. House Special Lo Mein  8.75 Chow Mei Fun  Chow Fun Thin rice noodlesFlat rice noodles 38. Vegetable Mei Fun  12.66 38. Vegetable Chow Fun  12.66 39. Roast Pork Mei Fun  12.66 39. Roast Pork Chow Fun  12.66 40. Chicken Mei Fun  12.66 40. Chicken Chow Fun  12.66 41. Beef Mei Fun  12.66 41. Beef Chow Fun  12.66 42. Shrimp Mei Fun  12.66 42. Shrimp Chow Fun  12.66 43. House Special Mei Fun  13.68 43. House Special Chow Fun  13.68 44. Singapore Mei Fun  13.68 Egg Foo Young served with white rice 3 patties 45. Vegetable Egg Foo Young  11.70 46. Roast Pork Egg Foo Young  12.21 47. Chicken Egg Foo Young  12.21 48. Beef Egg Foo Young  12.66 49. Shrimp Egg Foo Young  12.66 Pork served with white rice 50. Roast Pork with Broccoli  12.66 51. Roast Pork with Chinese Vegetable  12.66 52. Roast pork with Mushroom  12.66 53. Roast Pork with Hunan Sauce  12.66 54. Pork with Garlic Sauce  12.66 Vegetables served with white rice 55. Mixed Vegetables with Brown Sauce  10.95 56. Sautéed Broccoli  10.95 57. Bean Curd with Mixed Vegetable  11.87 58. Mixed Vegetable with Brown Sauce  10.95 59. Sautéed Broccoli with Garlic Sauce  10.95 60. Szechuan Vegetable  10.95 Chicken All white meat served with white rice Popular 62. Chicken with Broccoli  9.11 63. Sweet  Sour Chicken  12.95 64. Moo Goo Gai Pan  12.95 65. Chicken with Mixed Vegetables  12.95 66. Chicken with Chinese Vegetable  12.95 67. Chicken with Snow Peas  12.95 68. Cashew Chicken  12.95 69. Curry Chicken  12.95 70. Chicken with Garlic Sauce  12.95 71. Hunan Chicken  12.95 72. Szechuan Chicken  12.95 73. Kung Pao Chicken  12.95 Beef served with white rice 74. Beef with Broccoli  9.52 75. Pepper Steak with Onion  14.21 76. Beef with Chinese Vegetable  14.21 77. Beef with Snow Peas  14.21 78. Beef with Mixed Vegetables  14.21 79. Beef with Mushroom  14.21 80. Beef with Garlic Sauce  14.21 81. Shredded Beef Szechuan Style  14.21 82. Hunan Beef  14.21 83. Kung Pao Beef  14.21 Seafood served with white rice 84. Shrimp with Broccoli  9.52 85. Shrimp with Mixed Vegetables  14.21 86. Shrimp with Lobster Sauce  14.21 87. Shrimp with Chinese Vegetable  14.21 88. Shrimp with Snow Peas  14.21 89. Cashew Nuts Shrimp  14.21 90. Shrimp with Mushroom  14.21 91. Curry Shrimp  14.21 92. Shrimp with Garlic Sauce  14.21 93. Hunan Shrimp  14.21 94. Szechuan Shrimp  14.21 95. Kung Pao Shrimp  14.21 Healthy Choice Steamed Dishes Served with White Rice All the dishes has no oil, sugar, cornstarch  choice of brown sauce on the side D1. Steamed Vegetable Delight  11.29 D2. Steamed Chicken with Broccoli  13.03 D3. Steamed Chicken with Mixed Vegetables  13.03 D4. Steamed Shrimp with Broccoli  14.21 D5. Steamed Shrimp with Snow Peas  14.21 D6. Steamed Shrimp with Mixed Vegetables  14.21 Side Order Fortune Cookies 5  1.71 Crispy Noodles  1.71 White Rice  3.18 Brown Rice  3.74 Chefs Suggestions served with white rice S1. Orange Chicken  13.74 Popular S2. General Tsos Chicken Chicken chunks with tingling hot sauce  broccoli on two side  13.74 S3. Sesame Chicken  13.74 S4. General Tsos Shrimp  16.35 S5. Orange Beef Steak with dried orange peel, hot pepper in a sweet spicy sauce  16.35 S6. Mongolian Beef Marinated beef sautéed in a high heated wok with Chinese parsley scallion, garlic, wine. pepper  a blend of seasoning  16.35 S7. Sesame Beef Tender strips of marinated beef  broccoli cooked in a tangy sesame sauce  16.35 S8. Sesame Shrimp Jumbo shrimp deep fried until crispy with mixed veggie in tangy sesame sauce  16.35 S9. Kung Pao Delight Chicken  shrimp with spicy Kung Pao sauce  16.35 S10. Seafood Delight Whole lobster meat, scallops, jumbo shrimp sautéed with assorted Chinese vegetable in white sauce  18.57 S11. Double Delight in Garlic Sauce Fresh jumbo shrimp and sea scallops sautéed with snow peas, pepper, wood ears  broccoli  16.63 S12. Triple Delight in Garlic Sauce Sliced beef, chicken  jumbo shrimp sautéed with vegetables  16.35 S13. Dragon  Phoenix General Tsos chicken  jumbo shrimp w, chili sauce  16.35 S14. Happy Family Lobster, jumbo shrimp, beef, chicken and roast pork combined with Chinese vegetable  17.89 S15. Four Seasons Combination of chicken, beef shrimps, scallop with mixed vegetables in brown sauce  16.35 S16. Chicken  Shrimp in Hunan Style Chicken and shrimp in Hunan sauce with mixed vegetable  16.35 Dinner Specials Served all day 7 days a week. Served with egg roll and roast pork fried rice or white rice D1. Pork with Beoccoli Dinner Sp.  11.40 D1. Chicken with Beoccoli Dinner Sp.  11.40 D1. Beef with Beoccoli Dinner Sp.  11.40 D1. Shrimp with Beoccoli Dinner Sp.  11.40 D2. Pork with Mixed Vegetable Dinner Sp.  11.40 D2. Chicken with Mixed Vegetable Dinner Sp.  11.40 D2. Beef with Mixed Vegetable Dinner Sp.  11.40 D2. Shrimp with Mixed Vegetable Dinner Sp.  11.40 D3. Pork Lo Mein Dinner Sp.  11.40 D3. Chicken Lo Mein Dinner Sp.  11.40 D3. Beef Lo Mein Dinner Sp.  11.40 D3. Shrimp Lo Mein Dinner Sp.  11.40 D4. Pork with Garlic Sauce Dinner Sp.  11.40 D4. Chicken with Garlic Sauce Dinner Sp.  11.40 D4. Beef with Garlic Sauce Dinner Sp.  11.40 D4. Shrimp with Garlic Sauce Dinner Sp.  11.40 D5. Szechuan Pork Dinner Sp.  11.40 D5. Szechuan Chicken Dinner Sp.  11.40 D5. Szechuan Beef Dinner Sp.  11.40 D5. Szechuan Shrimp Dinner Sp.  11.40 D6. Hunan Pork Dinner Sp.  11.40 D6. Hunan Chicken Dinner Sp.  11.40 D6. Hunan Beef Dinner Sp.  11.40 D6. Hunan Shrimp Dinner Sp.  11.40 D7. Chinese Vegetables W. Chicken Dinner Sp.  11.40 D7. Chinese Vegetables w. Beef Dinner Sp.  11.40 D7. Chinese Vegetable w. Shrimp Dinner Sp.  11.40 D8. Chicken w. Cashew Nuts Dinner Sp.  11.40 D8. Shrimp w. Cashew Nuts Dinner Sp.  11.40 D9. Sesame Chicken Dinner Sp.  11.40 D10. Mixed Vegetable Dinner Sp  11.40 D11. Sweet  Sour Chicken Dinner Sp.  11.40 D12. Pepper Steak w. Onion Dinner Sp.  11.40 D13. Shrimp w. Lobster Sauce Dinner Sp.  11.40 D14. Boneless Spare Ribs Dinner Sp.  11.40 D15. Curry Chicken Dinner Sp.  11.40 D15. Curry Shrimp Dinner Sp.  11.40 D16. Kung Pao Chicken Dinner Sp.  11.40 D16. Kung Pao Shrimp Dinner Sp.  11.40 D17. Mongolian Chicken Dinner Sp.  11.40 D17. Mongolian Beef Dinner Sp.  11.40 Popular D18. General Tsos Chicken Dinner Sp.  11.40 D19. Orange Chicken Dinner Sp.  11.40 D20. Broccoli w.Garlic Sauce Dinner Sp.  11.40 D21. Sesame Shrimp Dinner Sp.  11.40 D23. BBQ Spare Ribs Dinner Sp.  11.40 Beverage Soda Can  2.10 Popular Soda Bottle 20 oz  2.95 Snapple 16 oz  2.95 Party Tray P1. Vegetable Fried Rice Party Tray  42.01 P1. Chicken Fried Rice Party Tray  42.01 P1. Pork Fried Rice Party Tray  42.01 P2. Beef Fried Rice Party Tray  46.55 P2. Shrimp Fried Rice Party Tray  46.55 P3. Vegetable Lo Mein Party Tray  43.14 P3. Chicken Lo Mein Party Tray  43.14 P3. Pork Lo Mein Party Tray  43.14 P4. Beef Lo Mein Party Tray  48.81 P4. Shrimp Lo Mein Party Tray  48.81 P5. Broccoli Chicken Party Tray  49.96 P5. Broccoli Pork Party Tray  49.96 P6. Broccoli Beef Party Tray  54.50 P6. Broccoli Shrimp Party Tray  54.50 P7. Sesame Chicken Party Tray  56.76 P8. General Tsos Chicken Party Tray  56.76 P9. Orange Chicken Party Tray  56.76 P10. White Rice Party Tray  17.02 Start New Order Great Wall Chinese Restaurant 219 Atlantic St, Stamford, CT 06901 203 327-7188 Store Information Closed See More"
}