{
  "timestamp": "2025-12-19T13:00:34.272896",
  "key": "menu_text:https://www.xianfoods.com/",
  "data": "Menu Our Story Locations Contact Catering PickupDelivery Shop B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B1 腊汁猪肉夹馍 Stewed Pork Burger N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles A1 凉皮 Liang Pi Cold-Skin Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B1 腊汁猪肉夹馍 Stewed Pork Burger N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles A1 凉皮 Liang Pi Cold-Skin Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B1 腊汁猪肉夹馍 Stewed Pork Burger N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles A1 凉皮 Liang Pi Cold-Skin Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B2 B2 B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger 孜然羊肉夹馍 Spicy Cumin Lamb Burger B1 腊汁猪肉夹馍 Stewed Pork Burger B1 腊汁猪肉夹馍 Stewed Pork Burger B1 B1 B1 腊汁猪肉夹馍 Stewed Pork Burger 腊汁猪肉夹馍 Stewed Pork Burger N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles N4 N4 N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles A1 凉皮 Liang Pi Cold-Skin Noodles A1 凉皮 Liang Pi Cold-Skin Noodles A1 A1 A1 凉皮 Liang Pi Cold-Skin Noodles 凉皮 Liang Pi Cold-Skin Noodles  Xian Famous Foods made a mark on the citys culinary world with its hand-pulled noodles and spicy Chinese fare.   ...they have customers who are fresh-off-the-boat Chinese immigrants or tourists on the other end, theyve gained followers with absolutely no Chinese heritage   Whats more satisfying...than a hearty, warm bowl of spicy beef with hand-pulled noodles?   Their meteoric New York City rise...is a better example of the American dream than most fiction.   Xian Famous Foods made a mark on the citys culinary world with its hand-pulled noodles and spicy Chinese fare.   Xian Famous Foods made a mark on the citys culinary world with its hand-pulled noodles and spicy Chinese fare.   Xian Famous Foods made a mark on the citys culinary world with its hand-pulled noodles and spicy Chinese fare.   ...they have customers who are fresh-off-the-boat Chinese immigrants or tourists on the other end, theyve gained followers with absolutely no Chinese heritage   ...they have customers who are fresh-off-the-boat Chinese immigrants or tourists on the other end, theyve gained followers with absolutely no Chinese heritage   ...they have customers who are fresh-off-the-boat Chinese immigrants or tourists on the other end, theyve gained followers with absolutely no Chinese heritage   Whats more satisfying...than a hearty, warm bowl of spicy beef with hand-pulled noodles?   Whats more satisfying...than a hearty, warm bowl of spicy beef with hand-pulled noodles?   Whats more satisfying...than a hearty, warm bowl of spicy beef with hand-pulled noodles?   Their meteoric New York City rise...is a better example of the American dream than most fiction.   Their meteoric New York City rise...is a better example of the American dream than most fiction.   Their meteoric New York City rise...is a better example of the American dream than most fiction.  A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles B1 腊汁猪肉夹馍 Stewed Pork Burger NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup A1 凉皮 Liang Pi Cold-Skin Noodles NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles B1 腊汁猪肉夹馍 Stewed Pork Burger NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup A1 凉皮 Liang Pi Cold-Skin Noodles NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles A2 A2 A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles N4 N4 N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles B1 腊汁猪肉夹馍 Stewed Pork Burger B1 腊汁猪肉夹馍 Stewed Pork Burger B1 B1 B1 腊汁猪肉夹馍 Stewed Pork Burger 腊汁猪肉夹馍 Stewed Pork Burger NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup NS4 NS4 NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup A1 凉皮 Liang Pi Cold-Skin Noodles A1 凉皮 Liang Pi Cold-Skin Noodles A1 A1 A1 凉皮 Liang Pi Cold-Skin Noodles 凉皮 Liang Pi Cold-Skin Noodles NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup NS1 NS1 NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles N9 N9 N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger B2 B2 B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger 孜然羊肉夹馍 Spicy Cumin Lamb Burger Our most popular dishes Family Recipes so good, theyre famous We make our familys versions of Xian classics. Think biang-biang noodles pulled to order, dumplings doused in our signature dipping sauce, and a refreshing, vinegar-y liang pi for hot summer days or any day. A2 热炒凉皮 Stir-Fried Liang Pi Cold-Skin Noodles N4 腊汁猪肉干扯面 Stewed Pork Hand-Ripped Noodles B1 腊汁猪肉夹馍 Stewed Pork Burger NS4 腊汁猪肉汤扯面 Stewed Pork Hand-Ripped Noodles in Soup A1 凉皮 Liang Pi Cold-Skin Noodles NS1 孜然羊肉汤扯面 Spicy Cumin Lamb Hand-Ripped Noodles In Soup N9 炸酱干扯面 Pork Zha Jiang Hand-Ripped Noodles B2 孜然羊肉夹馍 Spicy Cumin Lamb Burger Find your next go-to dish"
}